AqueronteBlog/ARM/NRF51/Examples/Drivers/ADXL345/Src/main.c
/**
 * @brief       main.c
 * @details     [todo]xxx.
 *
 *              This firmware is just an example about how to use the I2C on the nrf51422.
 *
 * @return      NA
 *
 * @author      Manuel Caballero
 * @date        11/August/2017
 * @version     11/August/2017    The ORIGIN
 * @pre         This firmware was tested on the nrf51-DK with EmBitz 1.11 rev 0
 *              ( SDK 1.1.0 ).
 * @warning     Softdevice S310 was used although the file's name is S130. The softdevice
 *              is not used in this example anyway because of Bluetooth was not used.
 * @pre         This code belongs to AqueronteBlog ( http://unbarquero.blogspot.com ).
 */

#include "nrf.h"
#include "ble.h"
#include "variables.h"
#include "functions.h"
#include "ADXL345.h"


int main( void )
{
    uint32_t aux           =       0;
    uint8_t  myID[]        =       { 0 };

    Vector_t                    myXYZVector, *myXYZptr = &myXYZVector;
    Vector_f                    myScaled_XYZVector, *myScaled_XYZptr = &myScaled_XYZVector;
    AXDL345_bw_rate_rate_t      myRate, *myRateptr = &myRate;

    conf_GPIO   ();
    conf_UART   ();
    conf_TWI0   ();
    conf_TIMER0 ();


    ADXL345_Init   ( NRF_TWI0, ADXL345_ALT_ADDRESS_LOW, BW_RATE_LOW_POWER_Disabled, BW_RATE_RATE_100HZ,
                     DATA_FORMAT_INT_INVERT_Disabled, DATA_FORMAT_FULL_RES_Disabled, DATA_FORMAT_JUSTIFY_Disabled,
                     DATA_FORMAT_RANGE_2_G );


    ADXL345_SetRate  ( NRF_TWI0, ADXL345_ALT_ADDRESS_LOW, BW_RATE_RATE_400HZ );
    ADXL345_GetRate  ( NRF_TWI0, ADXL345_ALT_ADDRESS_LOW, &myRateptr[0] );


    ADXL345_PowerMode ( NRF_TWI0, ADXL345_ALT_ADDRESS_LOW, MEASURE_MODE );


    mySTATE                  =   0;                 // Reset counter

    NRF_TIMER0->TASKS_START  =   1;                 // Start Timer0


    while( 1 )
    {
        //NRF_POWER->SYSTEMOFF = 1;
        NRF_POWER->TASKS_LOWPWR = 1;                // Sub power mode: Low power.

        // Enter System ON sleep mode
		__WFE();
		// Make sure any pending events are cleared
		__SEV();
		__WFE();

		switch ( mySTATE ){
        default:
        case 1:
            aux = ADXL345_GetID             ( NRF_TWI0, ADXL345_ALT_ADDRESS_LOW, &myID[0] );
            aux = ADXL345_ReadRawData       ( NRF_TWI0, ADXL345_ALT_ADDRESS_LOW, &myXYZptr[0] );
            aux = ADXL345_ReadScaledData    ( NRF_TWI0, ADXL345_ALT_ADDRESS_LOW, &myScaled_XYZptr[0] );
            mySTATE =   0;
            __NOP();
            break;

        case 2:
            break;

            /*
        case 3:
            // Start transmitting through the UART
            NRF_GPIO->OUTCLR             =   ( 1UL << LED1 );       // Turn the LED1 on

            myPtr                        =   &myRawLux[0];
            TX_inProgress                =   YES;
            NRF_UART0->TASKS_STARTTX     =   1;
            NRF_UART0->TXD               =   *myPtr++;              // MSB to be transmitted

            // Wait until the message is transmitted
            while ( TX_inProgress == YES ){
                __WFE();
                // Make sure any pending events are cleared
                __SEV();
                __WFE();
            }

            mySTATE =   0;
            break;
            */
		}

        //__NOP();

    }
}
